## Terraform Staging Environment Planner
### :art: Terraform Format and Style 
Code formatted with status of `success` .

### :tada: Terraform Initialization
Terraform initialized with status of `success` .

### :white_check_mark: Terraform Validation
The terraform code has been validated with the status of `success` .
For more information on the validation output, please expand the details below.
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### :memo: Terraform Plan
The terraform plan has been generated with the status of `success` .
For more information on the plan output, please expand the details below.
<details><summary>Show Plan</summary>

```

terraform
module.lambda_stack.aws_api_gateway_rest_api.this: Refreshing state... [id=ghbh7azlgi]
module.lambda_stack.aws_ecr_repository.this: Refreshing state... [id=lambda_api_staging_container_repository]
module.lambda_stack.data.aws_iam_policy_document.lambda_assume_role: Reading...
module.lambda_stack.data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]
module.lambda_stack.aws_iam_role.this: Refreshing state... [id=lambda_api_staging_lambda_function_role]
module.lambda_stack.aws_api_gateway_resource.this: Refreshing state... [id=vf4kju]
module.lambda_stack.aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-ghbh7azlgi-yy28wky3wh-ANY]
module.lambda_stack.aws_api_gateway_method.proxy: Refreshing state... [id=agm-ghbh7azlgi-vf4kju-ANY]
module.lambda_stack.null_resource.ecr_image: Refreshing state... [id=6979418511545604930]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lambda_stack.aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "ghbh7azlgi"
      + stage_name    = "staging"
    }

  # module.lambda_stack.aws_api_gateway_integration.lambda will be created
  + resource "aws_api_gateway_integration" "lambda" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "vf4kju"
      + rest_api_id             = "ghbh7azlgi"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.lambda_stack.aws_api_gateway_integration.lambda_root will be created
  + resource "aws_api_gateway_integration" "lambda_root" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "yy28wky3wh"
      + rest_api_id             = "ghbh7azlgi"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.lambda_stack.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function for lambda_api project in staging environment"
      + function_name                  = "lambda_api_staging_lambda_api"
      + id                             = (known after apply)
      + image_uri                      = "027075156904.dkr.ecr.us-east-1.amazonaws.com/lambda_api_staging_container_repository:e25cc9dd228fef37e4f08c9bc38a308dd6410e69"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::027075156904:role/lambda_api_staging_lambda_function_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_STAGE" = "staging"
            }
        }
    }

  # module.lambda_stack.aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda_api_staging_lambda_api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:027075156904:ghbh7azlgi/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + base_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @damarals, Action: `pull_request`, Workflow: `Create terraform plan of the API infrastructure`*